<?php

return [

    'required' => 'Поле *field* является обязательным',
    'isEmail' => 'Поле *field* должно быть в формате Email',
    'isNumber' => 'Поле *field* должно содержать число',
    'isFloat' => 'Поле *field* должно содержать вещественное число',
    'isDate' => 'Поле *field* должно содержать дату в формате *values*',
    'range' => 'Поле *field* должно быть длиной от *1* до *2* символов',
    'rangeTo' => 'Поле *field* должно быть длиной меньше *values* символов',
    'rangeFrom' => 'Поле *field* должно быть длиной больше *values* символов',
    'in' => 'Поле *field* должно иметь значение из списка: *values*',
    'length' => 'Поле *field* должно быть длиной в *values* символов',
    'regex' => 'Поле *field* содержит значение неправильного формата',
    'unique' => 'Поле *field* должно быть уникальным',
    'null' => 'Некорректное значение поля',
    'allowed' => 'Недопустимое расширение файла',
    'prohibited' => 'Недопустимое расширение файла',
    'sizeMustBeLarger' => 'Размер должен быть больше *values*',
    'sizeMustBeSmaller' => 'Размер должен быть меньше *values*',
    'sizeMustBeEqual' => 'Размер должен быть равен *values*',
    'undefined' => 'Неизвестная ошибка'

];